configuration/src/Catalogs/СтатусыОбъектов/СтатусыОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтатусыОбъектов</name>
  <comment>Хранит  элементы, соответствующие определенным статусам объектов.</comment>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>CodeReview</name>
      <description>Code review</description>
    </items>
    <items>
      <name>DesignReview</name>
      <description>Design review</description>
    </items>
    <items>
      <name>ВРаботе</name>
      <description>В работе</description>
    </items>
    <items>
      <name>ВРеализацию</name>
      <description>В реализацию</description>
    </items>
    <items>
      <name>Внедрение</name>
      <description>Внедрение</description>
    </items>
    <items>
      <name>ВнутреннееТестирование</name>
      <description>Внутреннее тестирование</description>
    </items>
    <items>
      <name>Документирование</name>
      <description>Документирование</description>
    </items>
    <items>
      <name>ЗапросТребований</name>
      <description>Запрос требований</description>
    </items>
    <items>
      <name>Масштабирование</name>
      <description>Масштабирование</description>
    </items>
    <items>
      <name>НаДоработку</name>
      <description>На доработку</description>
    </items>
    <items>
      <name>Рассмотрение</name>
      <description>На рассмотрении</description>
    </items>
    <items>
      <name>Новый</name>
      <description>Новый</description>
    </items>
    <items>
      <name>Отклонен</name>
      <description>Отклонен</description>
    </items>
    <items>
      <name>Отложен</name>
      <description>Отложен</description>
    </items>
    <items>
      <name>Приостановлен</name>
      <description>Приостановлен</description>
    </items>
    <items>
      <name>Проработка</name>
      <description>Проработка</description>
    </items>
    <items>
      <name>Протестирован</name>
      <description>Протестирован</description>
    </items>
    <items>
      <name>Публикация</name>
      <description>Публикация</description>
    </items>
    <items>
      <name>Рассмотрен</name>
      <description>Рассмотрен</description>
    </items>
    <items>
      <name>РевьюТребований</name>
      <description>Ревью требований</description>
    </items>
    <items>
      <name>Решен</name>
      <description>Решен</description>
    </items>
    <items>
      <name>Тестирование</name>
      <description>Тестирование</description>
    </items>
  </predefined>
  <attributes>
    <name>ИмяКартинкиВБиблиотеке</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИндексЗафиксирован</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИндексКартинки</name>
    <comment>Индекс изображения в общей картинке СтатусыОбъектов</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <comment>Порядковый номер статуса</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПричиныИзмененияСтатуса</name>
    <attributes>
      <name>Причина</name>
      <type>
        <types>CatalogRef.ПричиныИзмененияСтатусов</types>
      </type>
    </attributes>
    <attributes>
      <name>Порядок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

configuration/src/CommonForms/НастройкиСтруктурыПодчиненности/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтатусыОбъектов.Ссылка КАК Статус,
	|	СтатусыОбъектов.ИндексКартинки КАК ИндексКартинки,
	|	ВЫБОР
	|		КОГДА СтатусыОбъектов.Ссылка В (&ОтмеченныеСтатусы)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Пометка
	|ИЗ
	|	Справочник.СтатусыОбъектов КАК СтатусыОбъектов
	|
	|УПОРЯДОЧИТЬ ПО
	|	СтатусыОбъектов.Порядок";
	
	Запрос.УстановитьПараметр("ОтмеченныеСтатусы", Параметры.ВыбранныеСтатусы);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаСтатусов.Добавить(), Выборка);
	КонецЦикла;
	
	ГруппироватьПоСтатусам        = Параметры.ГруппироватьПоСтатусам;
	ОтображатьИерархию	          = Параметры.ОтображатьИерархию;
	ОтображатьИерархиюДляТекущего = Параметры.ОтображатьИерархиюДляТекущего;
	СкрыватьРешенные 			  = Параметры.СкрыватьРешенные;
	
	Элементы.ОтображатьИерархиюДляТекущего.Доступность   = ОтображатьИерархию;
	Элементы.ГруппаОтборПоСтатусам.Доступность = НЕ ОтображатьИерархию;
	Элементы.СкрыватьРешенные.Доступность = ОтображатьИерархию;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОтображатьИерархиюПриИзменении(Элемент)
	
	Если НЕ ОтображатьИерархию Тогда
		ОтображатьИерархиюДляТекущего = Ложь;
		СкрыватьРешенные = Ложь;
	Иначе
		ОтметитьВсе();
	КонецЕсли;
	
	Элементы.ОтображатьИерархиюДляТекущего.Доступность = ОтображатьИерархию;	
	Элементы.ГруппаОтборПоСтатусам.Доступность 		   = НЕ ОтображатьИерархию;
	Элементы.СкрыватьРешенные.Доступность			   = ОтображатьИерархию;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтметитьВсе(Команда = Неопределено)
	
	ИзменитьОтметки(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрименитьНастройки(Команда)
	
	// Формирование набора отмеченных статусов
	ОтмеченныеСтатусы = Новый СписокЗначений;
	Для Каждого СтрокаТаблицы Из ТаблицаСтатусов Цикл
		Если СтрокаТаблицы.Пометка Тогда
			ОтмеченныеСтатусы.Добавить(СтрокаТаблицы.Статус);
		КонецЕсли;
	КонецЦикла;
	
	Результат = Новый Структура;
	Результат.Вставить("ОтмеченныеСтатусы", ОтмеченныеСтатусы);
	Результат.Вставить("ГруппироватьПоСтатусам", ГруппироватьПоСтатусам);
	Результат.Вставить("ОтображатьИерархию", ОтображатьИерархию);
	Результат.Вставить("ОтображатьИерархиюДляТекущего", ОтображатьИерархиюДляТекущего);
	Результат.Вставить("СкрыватьРешенные", СкрыватьРешенные);
	
	СохранитьНастройкиФормы(Результат);
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметки(Команда)
	
	ИзменитьОтметки(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура СохранитьНастройкиФормы(НастройкиФормы)
	
	Ключ = ПолучитьКлючНастроек();
	ОбщегоНазначенияВызовСервера.СохранитьНастройкиДанныхФормы(Ключ.КлючОбъекта, Ключ.КлючНастроек, НастройкиФормы); 
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьКлючНастроек()
	
	Возврат Новый Структура("КлючОбъекта, КлючНастроек", "ОбщаяФорма.СтруктураПодчиненности", "НастройкиФормы");
	
КонецФункции

&НаКлиенте
Процедура ИзменитьОтметки(Знач Пометка)
	
	Для Каждого СтрокаТаблицы Из ТаблицаСтатусов Цикл
		СтрокаТаблицы.Пометка = Пометка;
	КонецЦикла;		
	
КонецПроцедуры

&НаКлиенте
Процедура СкрыватьРешенныеПриИзменении(Элемент)
	Если СкрыватьРешенные = Истина Тогда
		Для каждого СтрокаТаблицы из ТаблицаСтатусов Цикл
			Если Строка(СтрокаТаблицы.Статус) = "Решен" ИЛИ Строка(СтрокаТаблицы.Статус) = "Отклонен" Тогда
				СтрокаТаблицы.Пометка = Ложь;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Для каждого СтрокаТаблицы из ТаблицаСтатусов Цикл
			Если Строка(СтрокаТаблицы.Статус) = "Решен" ИЛИ Строка(СтрокаТаблицы.Статус) = "Отклонен" Тогда
				СтрокаТаблицы.Пометка = Истина;
			КонецЕсли;
		КонецЦикла;

	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
